РП/src/InformationRegisters/ОперацииДляДиспетчирования/ОперацииДляДиспетчирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииДляДиспетчирования</name>
  <comment>Регистр предназначен для использования в динамических списках, содержащих операции пооперационного расписания производства</comment>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.СтатусыВыполненияОпераций</types>
    </type>
  </resources>
  <resources>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛистПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийЦентр</name>
    <type>
      <types>String</types>
      <types>CatalogRef.РабочиеЦентры</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/ПооперационноеРасписание/ПооперационноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПооперационноеРасписание</name>
  <resources>
    <name>ВремяПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПерехода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоПереналадка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.СтатусыВыполненияОпераций</types>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Вспомогательная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Моделирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийЦентр</name>
    <type>
      <types>String</types>
      <types>CatalogRef.РабочиеЦентры</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛистПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельРасписания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельПланирования</name>
    <type>
      <types>CatalogRef.МоделиПооперационногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоУдалениеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТактПараллельнойЗагрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/ОперацииДляДиспетчирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОперацииДляДиспетчирования(Знач МаршрутныеЛисты) Экспорт
	
	ДокументыОбработать = Новый Массив;
	Для каждого Элемент Из МаршрутныеЛисты Цикл
		ДокументыОбработать.Добавить(Элемент);
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапросаЗаполнитьОперации();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МаршрутныеЛисты", ДокументыОбработать);
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОперацииДляДиспетчирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.МаршрутныйЛист.Установить(ВыборкаИтоги.МаршрутныйЛист);
		
		Выборка = ВыборкаИтоги.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
		ИндексДокумента = ДокументыОбработать.Найти(ВыборкаИтоги.МаршрутныйЛист);
		ДокументыОбработать.Удалить(ИндексДокумента);
		
	КонецЦикла;
	
	Для каждого МаршрутныйЛист Из ДокументыОбработать Цикл
		НаборЗаписей = РегистрыСведений.ОперацииДляДиспетчирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.МаршрутныйЛист.Установить(МаршрутныйЛист);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьОперации()
	
	Результат = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ПооперационноеРасписание.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ПооперационноеРасписание.ТактПараллельнойЗагрузки,
	|	ВЫРАЗИТЬ(ПооперационноеРасписание.РабочийЦентр КАК Справочник.РабочиеЦентры) КАК РабочийЦентр,
	|	ПооперационноеРасписание.Подразделение,
	|	ПооперационноеРасписание.СтатусВыполнения,
	|	ПооперационноеРасписание.Штрихкод,
	|	МИНИМУМ(ПооперационноеРасписание.Начало) КАК Начало,
	|	МАКСИМУМ(ПооперационноеРасписание.Окончание) КАК Окончание,
	|	МАКСИМУМ(ПооперационноеРасписание.Загрузка) КАК Загрузка
	|ПОМЕСТИТЬ ЗагрузкаПоТактам
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание КАК ПооперационноеРасписание
	|ГДЕ
	|	ПооперационноеРасписание.Моделирование = ЛОЖЬ
	|	И ПооперационноеРасписание.Вспомогательная = ЛОЖЬ
	|	И ПооперационноеРасписание.МаршрутныйЛист В(&МаршрутныеЛисты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПооперационноеРасписание.ИдентификаторОперации,
	|	ВЫРАЗИТЬ(ПооперационноеРасписание.РабочийЦентр КАК Справочник.РабочиеЦентры),
	|	ПооперационноеРасписание.СтатусВыполнения,
	|	ПооперационноеРасписание.МаршрутныйЛист,
	|	ПооперационноеРасписание.Подразделение,
	|	ПооперационноеРасписание.Штрихкод,
	|	ПооперационноеРасписание.ТактПараллельнойЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗагрузкаПоТактам.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ЗагрузкаПоТактам.ИдентификаторОперации,
	|	ЗагрузкаПоТактам.РабочийЦентр,
	|	ЗагрузкаПоТактам.Подразделение,
	|	ЗагрузкаПоТактам.СтатусВыполнения,
	|	ЗагрузкаПоТактам.Штрихкод,
	|	МИНИМУМ(ЗагрузкаПоТактам.Начало) КАК Начало,
	|	МАКСИМУМ(ЗагрузкаПоТактам.Окончание) КАК Окончание,
	|	СУММА(ЗагрузкаПоТактам.Загрузка) КАК Загрузка
	|ИЗ
	|	ЗагрузкаПоТактам КАК ЗагрузкаПоТактам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗагрузкаПоТактам.МаршрутныйЛист,
	|	ЗагрузкаПоТактам.ИдентификаторОперации,
	|	ЗагрузкаПоТактам.РабочийЦентр,
	|	ЗагрузкаПоТактам.Подразделение,
	|	ЗагрузкаПоТактам.СтатусВыполнения,
	|	ЗагрузкаПоТактам.Штрихкод
	|ИТОГИ ПО
	|	МаршрутныйЛист";
	
	Возврат Результат;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

#Область Обработчики_2_1_2

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
